package com.paradise.core.entity;

import lombok.Data;

import java.math.BigDecimal;
import java.util.Date;

@Data
public class HqData {

    private String name;
    private BigDecimal currentPrice;
    private BigDecimal increase;
    private Date date;
//    temp[0]------新浪------
//temp[1]------48.98------当前价
//temp[2]------ -0.57------涨幅（-0.57%）
//temp[3]------2016-06-22 08:19:42------时间
//temp[4]------ -0.28------涨跌
//temp[5]------49.31------开盘价
//temp[6]------49.83------最高价
//temp[7]------48.92------最低价
//temp[8]------57.01------52周最高
//temp[9]------32.61------52周最低
//temp[10]------280775------成交量
//temp[11]------609728------10日均量
//temp[12]------3443098080------市值
//temp[13]------0.79------每股收益
//temp[14]------62.00------市盈率
//temp[15]------0.00------
//temp[16]------1.15------贝塔系数
//temp[17]------0.00------
//temp[18]------0.00------
//temp[19]------70296000------股本
//temp[20]------58.00------
//temp[21]------48.98------今日收盘价
//temp[22]------0.00------
//temp[23]------0.00------
//temp[24]------------
//temp[25]------Jun 21 04:00PM EDT------
//temp[26]------49.26------昨日收盘价
//temp[27]------0.00------
}
